package opgave3;

public abstract class Ansat extends Person {

    private double timeløn;

    public Ansat(String navn, String addresse, double timeløn) {
        super(navn, addresse);
        this.timeløn = timeløn;
    }
    // ===========================================================
    // Fields
    // ===========================================================

    // ===========================================================
    // Constructors
    // ===========================================================

    // ===========================================================
    // Getter & Setter
    // ===========================================================

    // ===========================================================
    // Methods
    // ===========================================================

    public double beregnLoen() {
        return 37 * timeløn;
    }
}
